Revit 2024 API
AnalyticalToPhysicalAssociationManager Class
 Class which manages the associations between analytical elements and physical elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AnalyticalToPhysicalAssociationManager : Element
Visual Basic
Public Class AnalyticalToPhysicalAssociationManager _
	Inherits Element
Visual C++
public ref class AnalyticalToPhysicalAssociationManager : public Element
Remarks
 An element can be part of only one association at a time. Physical elements can have one of these categories:
Columns
Curtain Wall Panels
Floors
Generic Models
Mass
Parts
Railings
Ramps
Roofs
Stairs
Structural Columns
Structural Foundation
Structural Framing
Structural Trusses
Structural Beam System
Walls
 Analytical elements can have one of these categories:
Analytical Member
Analytical Panel
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager
See Also
AnalyticalToPhysicalAssociationManager Members
Autodesk.Revit.DB.Structure Namespace